Lagunaxx/ESP32_SPIDisplay/Extensions/Font/Font.cpp
 // Coded by Bodmer 10/2/18, see license in root directory.
 // This is part of the Screen class and is associated with anti-aliased font functions
 

////////////////////////////////////////////////////////////////////////////////////////
// New anti-aliased (smoothed) font functions added below
////////////////////////////////////////////////////////////////////////////////////////

/***************************************************************************************
** Function name:           loadFont
** Description:             loads parameters from a new font vlw file
*************************************************************************************x*/
#include "Font.h"

namespace Device{
	namespace Display{
		namespace Graphics{

	Font::Font(){
		gFont = { 0, 0, 0, 0, 0, 0, 0 };
		gUnicode = NULL;  //UTF-16 code, the codes are searched so do not need to be sequential
		gHeight = NULL;   //cheight
		gWidth = NULL;    //cwidth
		gxAdvance = NULL; //setWidth
		gdY = NULL;       //topExtent
		gdX = NULL;       //leftExtent
		gBitmap = NULL;   //file pointer to greyscale bitmap
		fontLoaded = false; // Flags when a anti-aliased font is loaded
		fontFile = new fs::File();
		textwrapX=false;
		textwrapY=false;
		textbgcolor=TFT_BLACK;
		textdatum=0;
		textfont=0;
		textcolor=0;
		decoderBuffer=0;
		gfxFont=0;
		textsize=0;
		_cp437    = true;
		_utf8     = true;
		  isDigits   = false;   // No bounding box adjustment
		  textwrapX  = true;    // Wrap text at end of line when using print stream
		  textwrapY  = false;   // Wrap text at bottom of screen when using print stream
		  textdatum = TL_DATUM; // Top Left text alignment is default
		  padX = 0;             // No padding
		  glyph_bb=0;
		  glyph_ab=0;

		  ImageBuffer=new c_TextBuffer();

#ifdef LOAD_GLCD
  fontsloaded  = 0x0002; // Bit 1 set
#endif

#ifdef LOAD_FONT2
  fontsloaded |= 0x0004; // Bit 2 set
#endif

#ifdef LOAD_FONT4
  fontsloaded |= 0x0010; // Bit 4 set
#endif

#ifdef LOAD_FONT6
  fontsloaded |= 0x0040; // Bit 6 set
#endif

#ifdef LOAD_FONT7
  fontsloaded |= 0x0080; // Bit 7 set
#endif

#ifdef LOAD_FONT8
  fontsloaded |= 0x0100; // Bit 8 set
#endif

#ifdef LOAD_FONT8N
  fontsloaded |= 0x0200; // Bit 9 set
#endif

#ifdef SMOOTH_FONT
  fontsloaded |= 0x8000; // Bit 15 set
#endif
	}
	Font::~Font(){

	}
		void Font::loadFont(String fontName, fs::FS &ffs)
		{
		  fontFS = ffs;
		  loadFont(fontName, false);
		}
		/***************************************************************************************
		** Function name:           loadFont
		** Description:             loads parameters from a new font vlw file
		*************************************************************************************x*/
		void Font::loadFont(String fontName, bool flash)
		{
		  /*
			The vlw font format does not appear to be documented anywhere, so some reverse
			engineering has been applied!

			Header of vlw file comprises 6 uint32_t parameters (24 bytes total):
			  1. The gCount (number of character glyphs)
			  2. A version number (0xB = 11 for the one I am using)
			  3. The font size (in points, not pixels)
			  4. Deprecated mboxY parameter (typically set to 0)
			  5. Ascent in pixels from baseline to top of "d"
			  6. Descent in pixels from baseline to bottom of "p"

			Next are gCount sets of values for each glyph, each set comprises 7 int32t parameters (28 bytes):
			  1. Glyph Unicode stored as a 32 bit value
			  2. Height of bitmap bounding box
			  3. Width of bitmap bounding box
			  4. gxAdvance for cursor (setWidth in Processing)
			  5. dY = distance from cursor baseline to top of glyph bitmap (signed value +ve = up)
			  6. dX = distance from cursor to left side of glyph bitmap (signed value -ve = left)
			  7. padding value, typically 0

			The bitmaps start next at 24 + (28 * gCount) bytes from the start of the file.
			Each pixel is 1 byte, an 8 bit Alpha value which represents the transparency from
			0xFF foreground colour, 0x00 background. The sketch uses a linear interpolation
			between the foreground and background RGB component colours. e.g.
				pixelRed = ((fgRed * alpha) + (bgRed * (255 - alpha))/255
			To gain a performance advantage fixed point arithmetic is used with rounding and
			division by 256 (shift right 8 bits is faster).

			After the bitmaps is:
			   1 byte for font name string length (excludes null)
			   a zero terminated character string giving the font name
			   1 byte for Postscript name string length
			   a zero/one terminated character string giving the font name
			   last byte is 0 for non-anti-aliased and 1 for anti-aliased (smoothed)

			Then the font name seen by Java when it's created
			Then the postscript name of the font
			Then a boolean to tell if smoothing is on or not.

			Glyph bitmap example is:
			// Cursor coordinate positions for this and next character are marked by 'C'
			// C<------- gxAdvance ------->C  gxAdvance is how far to move cursor for next glyph cursor position
			// |                           |
			// |                           |   ascent is top of "d", descent is bottom of "p"
			// +-- gdX --+             ascent
			// |         +-- gWidth--+     |   gdX is offset to left edge of glyph bitmap
			// |   +     x@.........@x  +  |   gdX may be negative e.g. italic "y" tail extending to left of
			// |   |     @@.........@@  |  |   cursor position, plot top left corner of bitmap at (cursorX + gdX)
			// |   |     @@.........@@ gdY |   gWidth and gHeight are glyph bitmap dimensions
			// |   |     .@@@.....@@@@  |  |
			// | gHeight ....@@@@@..@@  +  +    <-- baseline
			// |   |     ...........@@     |
			// |   |     ...........@@     |   gdY is the offset to the top edge of the bitmap
			// |   |     .@@.......@@. descent plot top edge of bitmap at (cursorY + yAdvance - gdY)
			// |   +     x..@@@@@@@..x     |   x marks the corner pixels of the bitmap
			// |                           |
			// +---------------------------+   yAdvance is y delta for the next line, font size or (ascent + descent)
			//                                  some fonts can overlay in y direction so may need a user adjust value

		  */

		  spiffs = flash;

		  if(spiffs) fontFS = SPIFFS;

		  unloadFont();

		  // Avoid a crash on the ESP32 if the file does not exist
		  if (fontFS.exists("/" + fontName + ".vlw") == false) {
			Serial.println("Font file " + fontName + " not found!");
			return;
		  }

		  *fontFile = fontFS.open( "/" + fontName + ".vlw", "r");

		  if(!fontFile) return;

		  fontFile->seek(0, fs::SeekSet);

		  gFont.gCount   = (uint16_t)readInt32(); // glyph count in file
									 readInt32(); // vlw encoder version - discard
		  gFont.yAdvance = (uint16_t)readInt32(); // Font size in points, not pixels
									 readInt32(); // discard
		  gFont.ascent   = (uint16_t)readInt32(); // top of "d"
		  gFont.descent  = (uint16_t)readInt32(); // bottom of "p"

