Lagunaxx/ESP32_SPIDisplay/Extensions/Font/Font.cpp
		  // These next gFont values might be updated when the Metrics are fetched
		  gFont.maxAscent  = gFont.ascent;   // Determined from metrics
		  gFont.maxDescent = gFont.descent;  // Determined from metrics
		  gFont.yAdvance   = gFont.ascent + gFont.descent;
		  gFont.spaceWidth = gFont.yAdvance / 4;  // Guess at space width

		  fontLoaded = true;

		  // Fetch the metrics for each glyph
		  loadMetrics(gFont.gCount);

		  //fontFile.close();
		}


		/***************************************************************************************
		** Function name:           loadMetrics
		** Description:             Get the metrics for each glyph and store in RAM
		*************************************************************************************x*/
		//#define SHOW_ASCENT_DESCENT
		void Font::loadMetrics(uint16_t gCount)
		{
		  uint32_t headerPtr = 24;
		  uint32_t bitmapPtr = 24 + gCount * 28;

		#if defined (ESP32) && defined (CONFIG_SPIRAM_SUPPORT)
		  if ( psramFound() )
		  {
			gUnicode  = (uint16_t*)ps_malloc( gCount * 2); // Unicode 16 bit Basic Multilingual Plane (0-FFFF)
			gHeight   =  (uint8_t*)ps_malloc( gCount );    // Height of glyph
			gWidth    =  (uint8_t*)ps_malloc( gCount );    // Width of glyph
			gxAdvance =  (uint8_t*)ps_malloc( gCount );    // xAdvance - to move x cursor
			gdY       =  (int16_t*)ps_malloc( gCount * 2); // offset from bitmap top edge from lowest point in any character
			gdX       =   (int8_t*)ps_malloc( gCount );    // offset for bitmap left edge relative to cursor X
			gBitmap   = (uint32_t*)ps_malloc( gCount * 4); // seek pointer to glyph bitmap in the file
		  }
		  else
		#endif
		  {
			gUnicode  = (uint16_t*)malloc( gCount * 2); // Unicode 16 bit Basic Multilingual Plane (0-FFFF)
			gHeight   =  (uint8_t*)malloc( gCount );    // Height of glyph
			gWidth    =  (uint8_t*)malloc( gCount );    // Width of glyph
			gxAdvance =  (uint8_t*)malloc( gCount );    // xAdvance - to move x cursor
			gdY       =  (int16_t*)malloc( gCount * 2); // offset from bitmap top edge from lowest point in any character
			gdX       =   (int8_t*)malloc( gCount );    // offset for bitmap left edge relative to cursor X
			gBitmap   = (uint32_t*)malloc( gCount * 4); // seek pointer to glyph bitmap in the file
		  }

		#ifdef SHOW_ASCENT_DESCENT
		  Serial.print("ascent  = "); Serial.println(gFont.ascent);
		  Serial.print("descent = "); Serial.println(gFont.descent);
		#endif

		  uint16_t gNum = 0;
		  fontFile->seek(headerPtr, fs::SeekSet);
		  while (gNum < gCount)
		  {
			gUnicode[gNum]  = (uint16_t)readInt32(); // Unicode code point value
			gHeight[gNum]   =  (uint8_t)readInt32(); // Height of glyph
			gWidth[gNum]    =  (uint8_t)readInt32(); // Width of glyph
			gxAdvance[gNum] =  (uint8_t)readInt32(); // xAdvance - to move x cursor
			gdY[gNum]       =  (int16_t)readInt32(); // y delta from baseline
			gdX[gNum]       =   (int8_t)readInt32(); // x delta from cursor
			readInt32(); // ignored

			//Serial.print("Unicode = 0x"); Serial.print(gUnicode[gNum], HEX); Serial.print(", gHeight  = "); Serial.println(gHeight[gNum]);
			//Serial.print("Unicode = 0x"); Serial.print(gUnicode[gNum], HEX); Serial.print(", gWidth  = "); Serial.println(gWidth[gNum]);
			//Serial.print("Unicode = 0x"); Serial.print(gUnicode[gNum], HEX); Serial.print(", gxAdvance  = "); Serial.println(gxAdvance[gNum]);
			//Serial.print("Unicode = 0x"); Serial.print(gUnicode[gNum], HEX); Serial.print(", gdY  = "); Serial.println(gdY[gNum]);

			// Different glyph sets have different ascent values not always based on "d", so we could get
			// the maximum glyph ascent by checking all characters. BUT this method can generate bad values
			// for non-existant glyphs, so we will reply on processing for the value and disable this code for now...
			/*
			if (gdY[gNum] > gFont.maxAscent)
			{
			  // Try to avoid UTF coding values and characters that tend to give duff values
			  if (((gUnicode[gNum] > 0x20) && (gUnicode[gNum] < 0x7F)) || (gUnicode[gNum] > 0xA0))
			  {
				gFont.maxAscent   = gdY[gNum];
		#ifdef SHOW_ASCENT_DESCENT
				Serial.print("Unicode = 0x"); Serial.print(gUnicode[gNum], HEX); Serial.print(", maxAscent  = "); Serial.println(gFont.maxAscent);
		#endif
			  }
			}
			*/

			// Different glyph sets have different descent values not always based on "p", so get maximum glyph descent
			if (((int16_t)gHeight[gNum] - (int16_t)gdY[gNum]) > gFont.maxDescent)
			{
			  // Avoid UTF coding values and characters that tend to give duff values
			  if (((gUnicode[gNum] > 0x20) && (gUnicode[gNum] < 0xA0) && (gUnicode[gNum] != 0x7F)) || (gUnicode[gNum] > 0xFF))
			  {
				gFont.maxDescent   = gHeight[gNum] - gdY[gNum];
		#ifdef SHOW_ASCENT_DESCENT
				Serial.print("Unicode = 0x"); Serial.print(gUnicode[gNum], HEX); Serial.print(", maxDescent = "); Serial.println(gHeight[gNum] - gdY[gNum]);
		#endif
			  }
			}

			gBitmap[gNum] = bitmapPtr;

			headerPtr += 28;

			bitmapPtr += gWidth[gNum] * gHeight[gNum];

			gNum++;
			yield();
		  }

		  gFont.yAdvance = gFont.maxAscent + gFont.maxDescent;

		  gFont.spaceWidth = (gFont.ascent + gFont.descent) * 2/7;  // Guess at space width
		}


		/***************************************************************************************
		** Function name:           deleteMetrics
		** Description:             Delete the old glyph metrics and free up the memory
		*************************************************************************************x*/
		void Font::unloadFont( void )
		{
		  if (gUnicode)
		  {
			free(gUnicode);
			gUnicode = NULL;
		  }

		  if (gHeight)
		  {
			free(gHeight);
			gHeight = NULL;
		  }

		  if (gWidth)
		  {
			free(gWidth);
			gWidth = NULL;
		  }

		  if (gxAdvance)
		  {
			free(gxAdvance);
			gxAdvance = NULL;
		  }

		  if (gdY)
		  {
			free(gdY);
			gdY = NULL;
		  }

		  if (gdX)
		  {
			free(gdX);
			gdX = NULL;
		  }

		  if (gBitmap)
		  {
			free(gBitmap);
			gBitmap = NULL;
		  }

		  if(fontFile) fontFile->close();
		  fontLoaded = false;
		}


		/***************************************************************************************
		** Function name:           decodeUTF8
		** Description:             Line buffer UTF-8 decoder with fall-back to extended ASCII
		*************************************************************************************x*/
		/* Function moved to Screen.cpp
		#define DECODE_UTF8
		uint16_t Font::decodeUTF8(uint8_t *buf, uint16_t *index, uint16_t remaining)
		{
		  byte c = buf[(*index)++];
		  //Serial.print("Byte from string = 0x"); Serial.println(c, HEX);

