Lagunaxx/ESP32_SPIDisplay/Extensions/Font/Font.cpp
		#ifdef DECODE_UTF8
		  // 7 bit Unicode
		  if ((c & 0x80) == 0x00) return c;

		  // 11 bit Unicode
		  if (((c & 0xE0) == 0xC0) && (remaining > 1))
			return ((c & 0x1F)<<6) | (buf[(*index)++]&0x3F);

		  // 16 bit Unicode
		  if (((c & 0xF0) == 0xE0) && (remaining > 2))
		  {
			c = ((c & 0x0F)<<12) | ((buf[(*index)++]&0x3F)<<6);
			return  c | ((buf[(*index)++]&0x3F));
		  }

		  // 21 bit Unicode not supported so fall-back to extended ASCII
		  // if ((c & 0xF8) == 0xF0) return c;
		#endif

		  return c; // fall-back to extended ASCII
		}
		*/

		/***************************************************************************************
		** Function name:           decodeUTF8
		** Description:             Serial UTF-8 decoder with fall-back to extended ASCII
		*************************************************************************************x*/
		/* Function moved to Screen.cpp
		uint16_t Font::decodeUTF8(uint8_t c)
		{

		#ifdef DECODE_UTF8

		  // 7 bit Unicode
		  if ((c & 0x80) == 0x00) {
			decoderState = 0;
			return (uint16_t)c;
		  }

		  if (decoderState == 0)
		  {
			// 11 bit Unicode
			if ((c & 0xE0) == 0xC0)
			{
			  decoderBuffer = ((c & 0x1F)<<6);
			  decoderState = 1;
			  return 0;
			}

			// 16 bit Unicode
			if ((c & 0xF0) == 0xE0)
			{
			  decoderBuffer = ((c & 0x0F)<<12);
			  decoderState = 2;
			  return 0;
			}
			// 21 bit Unicode not supported so fall-back to extended ASCII
			if ((c & 0xF8) == 0xF0) return (uint16_t)c;
		  }
		  else
		  {
			if (decoderState == 2)
			{
			  decoderBuffer |= ((c & 0x3F)<<6);
			  decoderState--;
			  return 0;
			}
			else
			{
			  decoderBuffer |= (c & 0x3F);
			  decoderState = 0;
			  return decoderBuffer;
			}
		  }
		#endif

		  decoderState = 0;
		  return (uint16_t)c; // fall-back to extended ASCII
		}
		*/



		/***************************************************************************************
		** Function name:           alphaBlend
		** Description:             Blend foreground and background and return new colour
		*************************************************************************************x*/
		uint16_t Font::alphaBlend(uint8_t alpha, uint16_t fgc, uint16_t bgc)
		{
		  // For speed use fixed point maths and rounding to permit a power of 2 division
		  uint16_t fgR = ((fgc >> 10) & 0x3E) + 1;
		  uint16_t fgG = ((fgc >>  4) & 0x7E) + 1;
		  uint16_t fgB = ((fgc <<  1) & 0x3E) + 1;

		  uint16_t bgR = ((bgc >> 10) & 0x3E) + 1;
		  uint16_t bgG = ((bgc >>  4) & 0x7E) + 1;
		  uint16_t bgB = ((bgc <<  1) & 0x3E) + 1;

		  // Shift right 1 to drop rounding bit and shift right 8 to divide by 256
		  uint16_t r = (((fgR * alpha) + (bgR * (255 - alpha))) >> 9);
		  uint16_t g = (((fgG * alpha) + (bgG * (255 - alpha))) >> 9);
		  uint16_t b = (((fgB * alpha) + (bgB * (255 - alpha))) >> 9);

		  // Combine RGB565 colours into 16 bits
		  //return ((r&0x18) << 11) | ((g&0x30) << 5) | ((b&0x18) << 0); // 2 bit greyscale
		  //return ((r&0x1E) << 11) | ((g&0x3C) << 5) | ((b&0x1E) << 0); // 4 bit greyscale
		  return (r << 11) | (g << 5) | (b << 0);
		}


		/***************************************************************************************
		** Function name:           readInt32
		** Description:             Get a 32 bit integer from the font file
		*************************************************************************************x*/
		uint32_t Font::readInt32(void)
		{
		  uint32_t val = 0;
		  val |= fontFile->read() << 24;
		  val |= fontFile->read() << 16;
		  val |= fontFile->read() << 8;
		  val |= fontFile->read();
		  return val;
		}


		/***************************************************************************************
		** Function name:           getUnicodeIndex
		** Description:             Get the font file index of a Unicode character
		*************************************************************************************x*/
		bool Font::getUnicodeIndex(uint16_t unicode, uint16_t *index)
		{
		  for (uint16_t i = 0; i < gFont.gCount; i++)
		  {
			if (gUnicode[i] == unicode)
			{
			  *index = i;
			  return true;
			}
		  }
		  return false;
		}


		/***************************************************************************************
		** Function name:           drawGlyph
		** Description:             Write a character to the TFT cursor position
		*************************************************************************************x*/
		// Expects file to be open
		void Font::drawGlyph(uint16_t code)//, c_Cursor &cursor)
		{
			_CoordsType cursor_x = ImageBuffer->X();
			_CoordsType cursor_y = ImageBuffer->Y();

		  if (code < 0x21)
		  {
			if (code == 0x20) {
			  cursor_x += gFont.spaceWidth;
			  ImageBuffer->X(cursor_x);
			  return;
			}

			if (code == '\n') {
			  ImageBuffer->X(0);
			  cursor_y += gFont.yAdvance;
			  if (cursor_y >= __height()) cursor_y = 0;
			  ImageBuffer->Set(cursor_x,cursor_y);
			  return;
			}
		  }

		  uint16_t gNum = 0;
		  bool found = getUnicodeIndex(code, &gNum);

		  uint16_t fg = _textcolor();
		  uint16_t bg = _textbgcolor();

		  if (found)
		  {

			if (textwrapX && (cursor_x + gWidth[gNum] + gdX[gNum] > Device::Display::Driver->width()))
			{
			  cursor_y += gFont.yAdvance;
			  cursor_x = 0;
			}
			if (textwrapY && ((cursor_y + gFont.yAdvance) >= Device::Display::Driver->height())) cursor_y = 0;
			if (cursor_x == 0) cursor_x -= gdX[gNum];

			fontFile->seek(gBitmap[gNum], fs::SeekSet); // This is taking >30ms for a significant position shift

			uint8_t pbuffer[gWidth[gNum]];

			_CoordsType xs = 0;
			uint32_t dl = 0;

			_CoordsType cy = cursor_y + gFont.maxAscent - gdY[gNum];
			_CoordsType cx = cursor_x + gdX[gNum];
			ImageBuffer->init(2,sizeof(uint16_t),cx,cy);

//			startWrite(); // Avoid slow ESP32 transaction overhead for every pixel

			for (int y = 0; y < gHeight[gNum]; y++)
			{
			  if (spiffs)
			  {
				fontFile->read(pbuffer, gWidth[gNum]);
				//Serial.println("SPIFFS");
			  }
			  else
			  {
//				endWrite();    // Release SPI for SD card transaction
				fontFile->read(pbuffer, gWidth[gNum]);
//				startWrite();  // Re-start SPI for TFT transaction
				//Serial.println("Not SPIFFS");
			  }

			  for (int x = 0; x < gWidth[gNum]; x++)
			  {
				uint8_t pixel = pbuffer[x]; //<//
				if (pixel)
				{
/*
					if (pixel != 0xFF)
				  {
					if (dl) {
					  if (dl==1) drawPixel(xs, y + cy, fg);
					  else drawFastHLine( xs, y + cy, dl, fg);
					  dl = 0;
					}
					drawPixel(x + cx, y + cy, alphaBlend(pixel, fg, bg));
				  }
				  else
				  {
					if (dl==0) xs = x + cx;
					dl++;
				  }// */

