Lagunaxx/ESP32_SPIDisplay/Extensions/Font/Font.cpp
				}
				else
				{
//				  if (dl) { drawFastHLine( xs, y + cy, dl, fg); dl = 0; }
				}
			  }
//			  if (dl) { drawFastHLine( xs, y + cy, dl, fg); dl = 0; }
			}// */

			cursor_x += gxAdvance[gNum];
//			endWrite();
		  }
		  else
		  {
			// Not a Unicode in font so draw a rectangle and move on cursor
//			drawRect(cursor_x, cursor_y + gFont.maxAscent - gFont.ascent, gFont.spaceWidth, gFont.ascent, fg);
			cursor_x += gFont.spaceWidth + 1;
		  }
		  ImageBuffer->Set(cursor_x, cursor_y);
		}

		/***************************************************************************************
		** Function name:           showFont
		** Description:             Page through all characters in font, td ms between screens
		*************************************************************************************x*/
		void Font::showFont(uint32_t td, Screen &display)
		{
/*		  if(!fontLoaded) return;

		  if(!fontFile)
		  {
			fontLoaded = false;
			return;
		  }

		  int16_t cursorX = Device::Display::Driver->width(); // Force start of new page to initialise cursor
		  int16_t cursorY = Device::Display::Driver->height();// for the first character
		  uint32_t timeDelay = 0;    // No delay before first page
		  c_Cursor *cursor=Cursor();

		  fillScreen(_textbgcolor());
		  //fillScreen(textbgcolor);

		  for (uint16_t i = 0; i < gFont.gCount; i++)
		  {
			// Check if this will need a new screen
			if (cursorX + gdX[i] + gWidth[i] >= Device::Display::Driver->width())  {
			  cursorX = -gdX[i];

			  cursorY += gFont.yAdvance;
			  if (cursorY + gFont.maxAscent + gFont.descent >= Device::Display::Driver->height()) {
				cursorX = -gdX[i];
				cursorY = 0;
				delay(timeDelay);
				timeDelay = td;
				fillScreen(_textbgcolor());
			  }
			}

			ImageBuffer->Set(cursorX, cursorY);
			drawGlyph(gUnicode[i], *cursor);
			cursorX += gxAdvance[i];
			//cursorX +=  printToSprite( cursorX, cursorY, i );
			yield();
		  }

		  delay(timeDelay);
		  fillScreen(_textbgcolor());
		  //fillScreen(textbgcolor);
		  //fontFile.close();

*/		}


		/**************************************************************************
		** Function name:           setAttribute
		** Description:             Sets a control parameter of an attribute
		**************************************************************************/
		void Font::setAttribute(uint8_t attr_id, uint8_t param) {
			switch (attr_id) {
					break;
				case 1:
					_cp437 = param;
					break;
				case 2:
					_utf8  = param;
					break;
				//case 3: // TBD future feature control
				//    _tbd = param;
				//    break;
			}
		}


		/**************************************************************************
		** Function name:           getAttribute
		** Description:             Get value of an attribute (control parameter)
		**************************************************************************/
		uint8_t Font::getAttribute(uint8_t attr_id) {
			switch (attr_id) {
				case 1: // ON/OFF control of full CP437 character set
					return _cp437;
					break;
				case 2: // ON/OFF control of UTF-8 decoding
					return _utf8;
					break;
				//case 3: // TBD future feature control
				//    return _tbd;
				//    break;
			}

			return false;
		}

		/***************************************************************************************
		** Function name:           setTextSize
		** Description:             Set the text size multiplier
		***************************************************************************************/
		void Font::setTextSize(uint8_t s)
		{
		  if (s>7) s = 7; // Limit the maximum size multiplier so byte variables can be used for rendering
		  textsize = (s > 0) ? s : 1; // Don't allow font size 0
		}


		/***************************************************************************************
		** Function name:           setTextColor
		** Description:             Set the font foreground colour (background is transparent)
		***************************************************************************************/
		void Font::setTextColor(uint16_t c)
		{
		  // For 'transparent' background, we'll set the bg
		  // to the same as fg instead of using a flag
		  textcolor = textbgcolor = c;
		}


		/***************************************************************************************
		** Function name:           setTextColor
		** Description:             Set the font foreground and background colour
		***************************************************************************************/
		void Font::setTextColor(uint16_t c, uint16_t b)
		{
		  textcolor   = c;
		  textbgcolor = b;
		}

		/***************************************************************************************
		** Function name:           setTextWrap
		** Description:             Define if text should wrap at end of line
		***************************************************************************************/
		void Font::setTextWrap(boolean wrapX, boolean wrapY)
		{
		  textwrapX = wrapX;
		  textwrapY = wrapY;
		}


		/***************************************************************************************
		** Function name:           setTextDatum
		** Description:             Set the text position reference datum
		***************************************************************************************/
		void Font::setTextDatum(uint8_t d)
		{
		  textdatum = d;
		}


		/***************************************************************************************
		** Function name:           setTextPadding
		** Description:             Define padding width (aids erasing old text and numbers)
		***************************************************************************************/
		void Font::setTextPadding(T_DispCoords x_width)
		{
		  padX = x_width;
		}

		/***************************************************************************************
		** Function name:           textWidth
		** Description:             Return the width in pixels of a string in a given font
		***************************************************************************************/
		T_DispCoords Font::textWidth(const String& string)
		{
		  int16_t len = string.length() + 2;
		  char buffer[len];
		  string.toCharArray(buffer, len);
		  return textWidth(buffer, textfont);
		}

		T_DispCoords Font::textWidth(const String& string, uint8_t font)
		{
		  int16_t len = string.length() + 2;
		  char buffer[len];
		  string.toCharArray(buffer, len);
		  return textWidth(buffer, font);
		}

		T_DispCoords Font::textWidth(const char *string)
		{
		  return textWidth(string, textfont);
		}

