Lagunaxx/ESP32_SPIDisplay/Extensions/Font/Font.cpp
		T_DispCoords Font::textWidth(const char *string, uint8_t font)
		{
			T_DispCoords str_width = 0;
		  uint16_t uniCode  = 0;

		#ifdef SMOOTH_FONT
		  if(fontLoaded)
		  {
			while (*string)
			{
			  uniCode = decodeUTF8(*string++);
			  if (uniCode)
			  {
				if (uniCode == 0x20) str_width += gFont.spaceWidth;
				else
				{
				  uint16_t gNum = 0;
				  bool found = getUnicodeIndex(uniCode, &gNum);
				  if (found)
				  {
					if(str_width == 0 && gdX[gNum] < 0) str_width -= gdX[gNum];
					if (*string || isDigits) str_width += gxAdvance[gNum];
					else str_width += (gdX[gNum] + gWidth[gNum]);
				  }
				  else str_width += gFont.spaceWidth + 1;
				}
			  }
			}
			isDigits = false;
			return str_width;
		  }
		#endif

		  if (font>1 && font<9)
		  {
			char *widthtable = (char *)pgm_read_dword( &(fontdata[font].widthtbl ) ) - 32; //subtract the 32 outside the loop

			while (*string)
			{
			  uniCode = *(string++);
			  if (uniCode > 31 && uniCode < 128)
			  str_width += pgm_read_byte( widthtable + uniCode); // Normally we need to subtract 32 from uniCode
			  else str_width += pgm_read_byte( widthtable + 32); // Set illegal character = space width
			}

		  }
		  else
		  {

		#ifdef LOAD_GFXFF
			if(gfxFont) // New font
			{
			  while (*string)
			  {
				uniCode = decodeUTF8(*string++);
				if ((uniCode >= pgm_read_word(&gfxFont->first)) && (uniCode <= pgm_read_word(&gfxFont->last )))
				{
				  uniCode -= pgm_read_word(&gfxFont->first);
				  GFXglyph *glyph  = &(((GFXglyph *)pgm_read_dword(&gfxFont->glyph))[uniCode]);
				  // If this is not the  last character or is a digit then use xAdvance
				  if (*string  || isDigits) str_width += pgm_read_byte(&glyph->xAdvance);
				  // Else use the offset plus width since this can be bigger than xAdvance
				  else str_width += ((int8_t)pgm_read_byte(&glyph->xOffset) + pgm_read_byte(&glyph->width));
				}
			  }
			}
			else
		#endif
			{
		#ifdef LOAD_GLCD
			  while (*string++) str_width += 6;
		#endif
			}
		  }
		  isDigits = false;
		  return str_width * textsize;
		}


		/***************************************************************************************
		** Function name:           fontsLoaded
		** Description:             return an encoded 16 bit value showing the fonts loaded
		***************************************************************************************/
		// Returns a value showing which fonts are loaded (bit N set =  Font N loaded)

		uint16_t Font::fontsLoaded(void)
		{
		  return fontsloaded;
		}


		/***************************************************************************************
		** Function name:           fontHeight
		** Description:             return the height of a font (yAdvance for free fonts)
		***************************************************************************************/
		T_DispCoords Font::fontHeight(int16_t font)
		{
		#ifdef SMOOTH_FONT
		  if(fontLoaded) return gFont.yAdvance;
		#endif

		#ifdef LOAD_GFXFF
		  if (font==1)
		  {
			if(gfxFont) // New font
			{
			  return pgm_read_byte(&gfxFont->yAdvance) * textsize;
			}
		  }
		#endif
		  return pgm_read_byte( &fontdata[font].height ) * textsize;
		}

		T_DispCoords Font::fontHeight(void)
		{
		  return fontHeight(textfont);
		}
		/***************************************************************************************
		** Function name:           drawString (with or without user defined font)
		** Description :            draw string with padding if it is defined
		***************************************************************************************/
		// Without font number, uses font set by setTextFont()
		T_DispCoords Font::drawString(const String& string, T_DispCoords poX, T_DispCoords poY)
		{
		  int16_t len = string.length() + 2;
		  char buffer[len];
		  string.toCharArray(buffer, len);
		  return drawString(buffer, poX, poY, textfont);
		}
		// With font number
		T_DispCoords Font::drawString(const String& string, T_DispCoords poX, T_DispCoords poY, uint8_t font)
		{
		  int16_t len = string.length() + 2;
		  char buffer[len];
		  string.toCharArray(buffer, len);
		  return drawString(buffer, poX, poY, font);
		}

		// Without font number, uses font set by setTextFont()
		T_DispCoords Font::drawString(const char *string, T_DispCoords poX, T_DispCoords poY)
		{
		  return drawString(string, poX, poY, textfont);
		}

		// With font number. Note: font number is over-ridden if a smooth font is loaded
		T_DispCoords Font::drawString(const char *string, T_DispCoords poX, T_DispCoords poY, uint8_t font)
		{
		  int16_t sumX = 0;
		  uint8_t padding = 1, baseline = 0;
		  uint16_t cwidth = textWidth(string, font); // Find the pixel width of the string in the font
		  uint16_t cheight = 8 * textsize;

		#ifdef LOAD_GFXFF
		  #ifdef SMOOTH_FONT
			bool freeFont = (font == 1 && gfxFont && !fontLoaded);
		  #else
			bool freeFont = (font == 1 && gfxFont);
		  #endif

		  if (freeFont) {
			cheight = glyph_ab * textsize;
			poY += cheight; // Adjust for baseline datum of free fonts
			baseline = cheight;
			padding =101; // Different padding method used for Free Fonts

			// We need to make an adjustment for the bottom of the string (eg 'y' character)
			if ((textdatum == BL_DATUM) || (textdatum == BC_DATUM) || (textdatum == BR_DATUM)) {
			  cheight += glyph_bb * textsize;
			}
		  }
		#endif


		  // If it is not font 1 (GLCD or free font) get the baseline and pixel height of the font
		#ifdef SMOOTH_FONT
		  if(fontLoaded) {
			baseline = gFont.maxAscent;
			cheight  = fontHeight();
		  }
		  else
		#endif
		  if (font!=1) {
			baseline = pgm_read_byte( &fontdata[font].baseline ) * textsize;
			cheight = fontHeight(font);
		  }

		  if (textdatum || padX)
		  {

			switch(textdatum) {
			  case TC_DATUM:
				poX -= cwidth/2;
				padding += 1;
				break;
			  case TR_DATUM:
				poX -= cwidth;
				padding += 2;
				break;
			  case ML_DATUM:
				poY -= cheight/2;
				//padding += 0;
				break;
			  case MC_DATUM:
				poX -= cwidth/2;
				poY -= cheight/2;
				padding += 1;
				break;
			  case MR_DATUM:
				poX -= cwidth;
				poY -= cheight/2;
				padding += 2;
				break;
			  case BL_DATUM:
				poY -= cheight;
				//padding += 0;
				break;
			  case BC_DATUM:
				poX -= cwidth/2;
				poY -= cheight;
				padding += 1;
				break;
			  case BR_DATUM:
				poX -= cwidth;
				poY -= cheight;
				padding += 2;
				break;
			  case L_BASELINE:
				poY -= baseline;
				//padding += 0;
				break;
			  case C_BASELINE:
				poX -= cwidth/2;
				poY -= baseline;
				padding += 1;
				break;
			  case R_BASELINE:
				poX -= cwidth;
				poY -= baseline;
				padding += 2;
				break;
			}
			// Check coordinates are OK, adjust if not
			if (poX < 0) poX = 0;
//			if (poX+cwidth > Device::Display::Driver->width())   poX = Device::Display::Driver->width() - cwidth;
			if (poY < 0) poY = 0;
//			if (poY+cheight-baseline> Device::Display::Driver->height()) poY = Device::Display::Driver->height() - cheight;
		  }


