Lagunaxx/ESP32_SPIDisplay/Extensions/Font/Font.cpp
		T_DispCoords Font::drawFloat(float floatNumber, uint8_t dp, T_DispCoords poX, T_DispCoords poY, uint8_t font)
		{
		  isDigits = true;
		  char str[14];               // Array to contain decimal string
		  uint8_t ptr = 0;            // Initialise pointer for array
		  int8_t  digits = 1;         // Count the digits to avoid array overflow
		  float rounding = 0.5;       // Round up down delta

		  if (dp > 7) dp = 7; // Limit the size of decimal portion

		  // Adjust the rounding value
		  for (uint8_t i = 0; i < dp; ++i) rounding /= 10.0;

		  if (floatNumber < -rounding)    // add sign, avoid adding - sign to 0.0!
		  {
			str[ptr++] = '-'; // Negative number
			str[ptr] = 0; // Put a null in the array as a precaution
			digits = 0;   // Set digits to 0 to compensate so pointer value can be used later
			floatNumber = -floatNumber; // Make positive
		  }

		  floatNumber += rounding; // Round up or down

		  // For error put ... in string and return (all Screen library fonts contain . character)
		  if (floatNumber >= 2147483647) {
			strcpy(str, "...");
			return drawString(str, poX, poY, font);
		  }
		  // No chance of overflow from here on

		  // Get integer part
		  uint32_t temp = (uint32_t)floatNumber;

		  // Put integer part into array
		  ltoa(temp, str + ptr, 10);

		  // Find out where the null is to get the digit count loaded
		  while ((uint8_t)str[ptr] != 0) ptr++; // Move the pointer along
		  digits += ptr;                  // Count the digits

		  str[ptr++] = '.'; // Add decimal point
		  str[ptr] = '0';   // Add a dummy zero
		  str[ptr + 1] = 0; // Add a null but don't increment pointer so it can be overwritten

		  // Get the decimal portion
		  floatNumber = floatNumber - temp;

		  // Get decimal digits one by one and put in array
		  // Limit digit count so we don't get a false sense of resolution
		  uint8_t i = 0;
		  while ((i < dp) && (digits < 9)) // while (i < dp) for no limit but array size must be increased
		  {
			i++;
			floatNumber *= 10;       // for the next decimal
			temp = floatNumber;      // get the decimal
			ltoa(temp, str + ptr, 10);
			ptr++; digits++;         // Increment pointer and digits count
			floatNumber -= temp;     // Remove that digit
		  }

		  // Finally we can plot the string and return pixel length
		  return drawString(str, poX, poY, font);
		}


		/***************************************************************************************
		** Function name:           setFreeFont
		** Descriptions:            Sets the GFX free font to use
		***************************************************************************************/

		#ifdef LOAD_GFXFF

		void Font::setFreeFont(const GFXfont *f)
		{
		  if (f == nullptr) // Fix issue #400 (ESP32 crash)
		  {
			setTextFont(1); // Use GLCD font
			return;
		  }

		  textfont = 1;
		  gfxFont = (GFXfont *)f;

		  glyph_ab = 0;
		  glyph_bb = 0;
		  uint16_t numChars = pgm_read_word(&gfxFont->last) - pgm_read_word(&gfxFont->first);

		  // Find the biggest above and below baseline offsets
		  for (uint8_t c = 0; c < numChars; c++)
		  {
			GFXglyph *glyph1  = &(((GFXglyph *)pgm_read_dword(&gfxFont->glyph))[c]);
			int8_t ab = -pgm_read_byte(&glyph1->yOffset);
			if (ab > glyph_ab) glyph_ab = ab;
			int8_t bb = pgm_read_byte(&glyph1->height) - ab;
			if (bb > glyph_bb) glyph_bb = bb;
		  }
		}


		/***************************************************************************************
		** Function name:           setTextFont
		** Description:             Set the font for the print stream
		***************************************************************************************/
		void Font::setTextFont(uint8_t f)
		{
		  textfont = (f > 0) ? f : 1; // Don't allow font 0
		  gfxFont = NULL;
		}

		#else


		/***************************************************************************************
		** Function name:           setFreeFont
		** Descriptions:            Sets the GFX free font to use
		***************************************************************************************/

		// Alternative to setTextFont() so we don't need two different named functions
		void Font::setFreeFont(uint8_t font)
		{
		  setTextFont(font);
		}


		/***************************************************************************************
		** Function name:           setTextFont
		** Description:             Set the font for the print stream
		***************************************************************************************/
		void Font::setTextFont(uint8_t f)
		{
		  textfont = (f > 0) ? f : 1; // Don't allow font 0
		}

		#endif

		  uint32_t Font::_textcolor(){
			  return (unsigned int)textcolor;
		  }
		  uint32_t Font::_textbgcolor(){
			  return (unsigned int)textbgcolor;
		  }
		  uint8_t Font::_textsize(){
			  return (uint8_t)textsize;
		  }
			/***************************************************************************************
			** Function name:           decodeUTF8
			** Description:             Serial UTF-8 decoder with fall-back to extended ASCII
			*************************************************************************************x*/
			#define DECODE_UTF8 // Test only, comment out to stop decoding
			uint16_t Font::decodeUTF8(uint8_t c)
			{
			#ifdef DECODE_UTF8
			  // 7 bit Unicode Code Point
			  if ((c & 0x80) == 0x00) {
				decoderState = 0;
				return (uint16_t)c;
			  }

			  if (decoderState == 0)
			  {
				// 11 bit Unicode Code Point
				if ((c & 0xE0) == 0xC0)
				{
				  decoderBuffer = ((c & 0x1F)<<6);
				  decoderState = 1;
				  return 0;
				}

				// 16 bit Unicode Code Point
				if ((c & 0xF0) == 0xE0)
				{
				  decoderBuffer = ((c & 0x0F)<<12);
				  decoderState = 2;
				  return 0;
				}
				// 21 bit Unicode  Code Point not supported so fall-back to extended ASCII
				if ((c & 0xF8) == 0xF0) return (uint16_t)c;
			  }
			  else
			  {
				if (decoderState == 2)
				{
				  decoderBuffer |= ((c & 0x3F)<<6);
				  decoderState--;
				  return 0;
				}
				else
				{
				  decoderBuffer |= (c & 0x3F);
				  decoderState = 0;
				  return decoderBuffer;
				}
			  }

			  decoderState = 0;
			#endif

			  return (uint16_t)c; // fall-back to extended ASCII
			}


			/***************************************************************************************
			** Function name:           decodeUTF8
			** Description:             Line buffer UTF-8 decoder with fall-back to extended ASCII
			*************************************************************************************x*/
			uint16_t Font::decodeUTF8(uint8_t *buf, uint16_t *index, uint16_t remaining)
			{
			  uint16_t c = buf[(*index)++];
			  //Serial.print("Byte from string = 0x"); Serial.println(c, HEX);

