Lagunaxx/ESP32_SPIDisplay/Extensions/Font/Font.cpp
			#ifdef DECODE_UTF8
			  // 7 bit Unicode
			  if ((c & 0x80) == 0x00) return c;

			  // 11 bit Unicode
			  if (((c & 0xE0) == 0xC0) && (remaining > 1))
				return ((c & 0x1F)<<6) | (buf[(*index)++]&0x3F);

			  // 16 bit Unicode
			  if (((c & 0xF0) == 0xE0) && (remaining > 2))
			  {
				c = ((c & 0x0F)<<12) | ((buf[(*index)++]&0x3F)<<6);
				return  c | ((buf[(*index)++]&0x3F));
			  }

			  // 21 bit Unicode not supported so fall-back to extended ASCII
			  // if ((c & 0xF8) == 0xF0) return c;
			#endif

			  return c; // fall-back to extended ASCII
			}


			/***************************************************************************************
			** Function name:           write
			** Description:             draw characters piped through serial stream
			***************************************************************************************/
			size_t Font::write(uint8_t utf8)
			{
			  if (utf8 == '\r') return 1;

			  uint16_t uniCode = utf8;

			  if (_utf8) uniCode = decodeUTF8(utf8);

			  if (uniCode == 0) return 1;

			#ifdef SMOOTH_FONT
			  if(fontLoaded)
			  {
				//Serial.print("UniCode="); Serial.println(uniCode);
				//Serial.print("UTF8   ="); Serial.println(utf8);

				//fontFile = SPIFFS.open( _gFontFilename, "r" );

				//if(!fontFile)
				//{
				//  fontLoaded = false;
				//  return 1;
				//}

//				drawGlyph(uniCode, *cursor);//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics

				//fontFile.close();
				return 1;
			  }
			#endif

			  if (uniCode == '\n') uniCode+=22; // Make it a valid space character to stop errors
			  else if (uniCode < 32) return 1;

			  T_DispCoords width = 0;
			  T_DispCoords height = 0;

			//vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv DEBUG vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv
			  //Serial.print((uint8_t) uniCode); // Debug line sends all printed TFT text to serial port
			  //Serial.println(uniCode, HEX); // Debug line sends all printed TFT text to serial port
			  //delay(5);                     // Debug optional wait for serial port to flush through
			//^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ DEBUG ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

			//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
			#ifdef LOAD_GFXFF
			  if(!gfxFont) {
			#endif
			//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<

			#ifdef LOAD_FONT2
			  if (textfont == 2)
			  {
				if (uniCode > 127) return 1;

				width = pgm_read_byte(widtbl_f16 + uniCode-32);
				height = chr_hgt_f16;
				// Font 2 is rendered in whole byte widths so we must allow for this
				width = (width + 6) / 8;  // Width in whole bytes for font 2, should be + 7 but must allow for font width change
				width = width * 8;        // Width converted back to pixels
			  }
			  #ifdef LOAD_RLE
			  else
			  #endif
			#endif

			#ifdef LOAD_RLE
			  {
				if ((textfont>2) && (textfont<9))
				{
				  if (uniCode > 127) return 1;
				  // Uses the fontinfo struct array to avoid lots of 'if' or 'switch' statements
				  width = pgm_read_byte( (uint8_t *)pgm_read_dword( &(fontdata[textfont].widthtbl ) ) + uniCode-32 );
				  height= pgm_read_byte( &fontdata[textfont].height );
				}
			  }
			#endif

			#ifdef LOAD_GLCD
			  if (textfont==1)
			  {
				  width =  6;
				  height = 8;
			  }
			#else
			  if (textfont==1) return 1;
			#endif

			  height = height * textsize;


/*

			  if (utf8 == '\n') {
				ImageBuffer->MoveY(height);
				ImageBuffer->X(0);
			  }
			  else
			  {
				if (textwrapX && (ImageBuffer->X() + width * textsize > _width))
				{
					ImageBuffer->MoveY(height);
					ImageBuffer->X(0);
				}
				if (textwrapY && (ImageBuffer->Y() >= (int32_t)_height)) ImageBuffer->Y(0);
				ImageBuffer->MoveX(drawChar(uniCode, ImageBuffer->X(), ImageBuffer->Y(), textfont));
			  }*///ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics


			//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
			#ifdef LOAD_GFXFF
			  } // Custom GFX font
			  else
			  {
				if(utf8 == '\n') {
//				  ImageBuffer->X(0); //ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
//				  ImageBuffer->MoveY((int16_t)textsize *
//							  (uint8_t)pgm_read_byte(&gfxFont->yAdvance)); //ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
				} else {
				  if (uniCode > pgm_read_word(&gfxFont->last )) return 1;
				  if (uniCode < pgm_read_word(&gfxFont->first)) return 1;

				  uint16_t   c2    = uniCode - pgm_read_word(&gfxFont->first);
				  GFXglyph *glyph = &(((GFXglyph *)pgm_read_dword(&gfxFont->glyph))[c2]);
				  uint8_t   w     = pgm_read_byte(&glyph->width),
							h     = pgm_read_byte(&glyph->height);

/*				  if((w > 0) && (h > 0)) { // Is there an associated bitmap?
					int16_t xo = (int8_t)pgm_read_byte(&glyph->xOffset);


					if(textwrapX && ((ImageBuffer->X() + textsize * (xo + w)) > _width)) {
					  // Drawing character would go off right edge; wrap to new line
					  ImageBuffer->X(0);
					  ImageBuffer->MoveY((int16_t)textsize *
								  (uint8_t)pgm_read_byte(&gfxFont->yAdvance));
					}
					if (textwrapY && (ImageBuffer->Y() >= (int32_t)_height)) ImageBuffer->Y(0);
					drawChar(ImageBuffer->X(), ImageBuffer->Y(), uniCode, textcolor, textbgcolor, textsize);
				  }
				  ImageBuffer->MoveX(pgm_read_byte(&glyph->xAdvance) * (int16_t)textsize);

				  *///ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
				}
			  }
			#endif // LOAD_GFXFF
			//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<

			  return 1;
			}


			/***************************************************************************************
			** Function name:           drawChar
			** Description:             draw a Unicode glyph onto the screen
			***************************************************************************************/
			  // Any UTF-8 decoding must be done before calling drawChar()
			T_DispCoords Font::drawChar(uint16_t uniCode, T_DispCoords x, T_DispCoords y)
			{
			  return drawChar(uniCode, x, y, textfont);
			}

			  // Any UTF-8 decoding must be done before calling drawChar()
			T_DispCoords Font::drawChar(uint16_t uniCode, T_DispCoords x, T_DispCoords y, uint8_t font)
			{
			  if (!uniCode) return 0;

			  if (font==1)
			  {
			#ifdef LOAD_GLCD
			  #ifndef LOAD_GFXFF
				drawChar(x, y, uniCode, textcolor, textbgcolor, textsize);
				return 6 * textsize;
			  #endif
			#else
			  #ifndef LOAD_GFXFF
				return 0;
			  #endif
			#endif

			#ifdef LOAD_GFXFF
				drawChar(x, y, uniCode, textcolor, textbgcolor, textsize);
				if(!gfxFont) { // 'Classic' built-in font
				#ifdef LOAD_GLCD
				  return 6 * textsize;
				#else
				  return 0;
				#endif
				}
				else
				{
				  if((uniCode >= pgm_read_word(&gfxFont->first)) && (uniCode <= pgm_read_word(&gfxFont->last) ))
				  {
					uint16_t   c2    = uniCode - pgm_read_word(&gfxFont->first);
					GFXglyph *glyph = &(((GFXglyph *)pgm_read_dword(&gfxFont->glyph))[c2]);
					return pgm_read_byte(&glyph->xAdvance) * textsize;
				  }
				  else
				  {
					return 0;
				  }
				}
			#endif
			  }

			  if ((font>1) && (font<9) && ((uniCode < 32) || (uniCode > 127))) return 0;

			  T_DispCoords width  = 0;
			  T_DispCoords height = 0;
			  uint32_t flash_address = 0;
			  uniCode -= 32;

