Lagunaxx/ESP32_SPIDisplay/Extensions/Font/Font.cpp
			#ifdef LOAD_FONT2
			  if (font == 2)
			  {
				flash_address = pgm_read_dword(&chrtbl_f16[uniCode]);
				width = pgm_read_byte(widtbl_f16 + uniCode);
				height = chr_hgt_f16;
			  }
			  #ifdef LOAD_RLE
			  else
			  #endif
			#endif

			#ifdef LOAD_RLE
			  {
				if ((font>2) && (font<9))
				{
				  flash_address = pgm_read_dword( (const void*)(pgm_read_dword( &(fontdata[font].chartbl ) ) + uniCode*sizeof(void *)) );
				  width = pgm_read_byte( (uint8_t *)pgm_read_dword( &(fontdata[font].widthtbl ) ) + uniCode );
				  height= pgm_read_byte( &fontdata[font].height );
				}
			  }
			#endif

			  int32_t w = width;
			  int32_t pX      = 0;
			  int32_t pY      = y;
			  uint8_t line = 0;

			#ifdef LOAD_FONT2 // chop out code if we do not need it
			  if (font == 2) {
				w = w + 6; // Should be + 7 but we need to compensate for width increment
				w = w / 8;
//				if (x + width * textsize >= (int16_t)_width) return width * textsize ;//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics

				if (textcolor == textbgcolor || textsize != 1) {
				  //spi_begin();          // Sprite class can use this function, avoiding spi_begin()
//				  inTransaction = true;//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics

				  for (int32_t i = 0; i < height; i++)
				  {
//					if (textcolor != textbgcolor) fillRect(x, pY, width * textsize, textsize, textbgcolor);//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics

					for (int32_t k = 0; k < w; k++)
					{
					  line = pgm_read_byte((uint8_t *)flash_address + w * i + k);
/*
					  if (line) {
						if (textsize == 1) {
						  pX = x + k * 8;
						  if (line & 0x80) drawPixel(pX, pY, textcolor);
						  if (line & 0x40) drawPixel(pX + 1, pY, textcolor);
						  if (line & 0x20) drawPixel(pX + 2, pY, textcolor);
						  if (line & 0x10) drawPixel(pX + 3, pY, textcolor);
						  if (line & 0x08) drawPixel(pX + 4, pY, textcolor);
						  if (line & 0x04) drawPixel(pX + 5, pY, textcolor);
						  if (line & 0x02) drawPixel(pX + 6, pY, textcolor);
						  if (line & 0x01) drawPixel(pX + 7, pY, textcolor);
						}
						else {
						  pX = x + k * 8 * textsize;
						  if (line & 0x80) fillRect(pX, pY, textsize, textsize, textcolor);
						  if (line & 0x40) fillRect(pX + textsize, pY, textsize, textsize, textcolor);
						  if (line & 0x20) fillRect(pX + 2 * textsize, pY, textsize, textsize, textcolor);
						  if (line & 0x10) fillRect(pX + 3 * textsize, pY, textsize, textsize, textcolor);
						  if (line & 0x08) fillRect(pX + 4 * textsize, pY, textsize, textsize, textcolor);
						  if (line & 0x04) fillRect(pX + 5 * textsize, pY, textsize, textsize, textcolor);
						  if (line & 0x02) fillRect(pX + 6 * textsize, pY, textsize, textsize, textcolor);
						  if (line & 0x01) fillRect(pX + 7 * textsize, pY, textsize, textsize, textcolor);
						}
					  }
					  *///ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
					}
					pY += textsize;
				  }

//				  inTransaction = false;//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
//				  spi_end();//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
				}
				else
				  // Faster drawing of characters and background using block write
				{
//				  spi_begin();//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics

//				  setWindow(x, y, x + width - 1, y + height - 1);//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics

				  uint8_t mask;
				  for (int32_t i = 0; i < height; i++)
				  {
					pX = width;
					for (int32_t k = 0; k < w; k++)
					{
					  line = pgm_read_byte((uint8_t *) (flash_address + w * i + k) );
					  mask = 0x80;
					  while (mask && pX) {
						if (line & mask) {tft_Write_16(textcolor);}
						else {tft_Write_16(textbgcolor);}
						pX--;
						mask = mask >> 1;
					  }
					}
					if (pX) {tft_Write_16(textbgcolor);}
				  }

//				  spi_end();//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
				}
			  }

			  #ifdef LOAD_RLE
			  else
			  #endif
			#endif  //FONT2

			#ifdef LOAD_RLE  //674 bytes of code
			  // Font is not 2 and hence is RLE encoded
			  {
/*				spi_begin();
				inTransaction = true;*///ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics

				w *= height; // Now w is total number of pixels in the character
				if ((textsize != 1) || (textcolor == textbgcolor)) {
//				  if (textcolor != textbgcolor) fillRect(x, pY, width * textsize, textsize * height, textbgcolor);//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
				  int32_t px = 0, py = pY; // To hold character block start and end column and row values
				  int32_t pc = 0; // Pixel count
				  uint8_t np = textsize * textsize; // Number of pixels in a drawn pixel

				  uint8_t tnp = 0; // Temporary copy of np for while loop
				  uint8_t ts = textsize - 1; // Temporary copy of textsize
				  // 16 bit pixel count so maximum font size is equivalent to 180x180 pixels in area
				  // w is total number of pixels to plot to fill character block
				  while (pc < w)
				  {
					line = pgm_read_byte((uint8_t *)flash_address);
					flash_address++;
					if (line & 0x80) {
					  line &= 0x7F;
					  line++;
					  if (ts) {
						px = x + textsize * (pc % width); // Keep these px and py calculations outside the loop as they are slow
						py = y + textsize * (pc / width);
					  }
					  else {
						px = x + pc % width; // Keep these px and py calculations outside the loop as they are slow
						py = y + pc / width;
					  }
					  while (line--) { // In this case the while(line--) is faster
						pc++; // This is faster than putting pc+=line before while()?
//						setWindow(px, py, px + ts, py + ts);//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics

						if (ts) {
						  tnp = np;
						  while (tnp--) {tft_Write_16(textcolor);}
						}
						else {tft_Write_16(textcolor);}
						px += textsize;

						if (px >= (x + width * textsize))
						{
						  px = x;
						  py += textsize;
						}
					  }
					}
					else {
					  line++;
					  pc += line;
					}
				  }
				}
				else // Text colour != background && textsize = 1
					 // so use faster drawing of characters and background using block write
				{
//				  setWindow(x, y, x + width - 1, y + height - 1);//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics

