Lagunaxx/ESP32_SPIDisplay/Extensions/Font/Font.cpp
			#ifdef RPI_WRITE_STROBE
				  uint8_t textcolorBin[] = { (uint8_t) (textcolor >> 8), (uint8_t) textcolor };
				  uint8_t textbgcolorBin[] = { (uint8_t) (textbgcolor >> 8), (uint8_t) textbgcolor };
			#endif

				  // Maximum font size is equivalent to 180x180 pixels in area
				  while (w > 0)
				  {
					line = pgm_read_byte((uint8_t *)flash_address++); // 8 bytes smaller when incrementing here
					if (line & 0x80) {
					  line &= 0x7F;
					  line++; w -= line;
			#ifdef RPI_WRITE_STROBE
					  spi.writePattern(&textcolorBin[0], 2, 1); line--;
					  while(line--) {WR_L; WR_H;}
			#else
					  #ifdef ESP32_PARALLEL
						while (line--) {tft_Write_16(textcolor);}
					  #else
//						writeBlock(textcolor,line);//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
					  #endif
			#endif
					}
					else {
					  line++; w -= line;
			#ifdef RPI_WRITE_STROBE
					  spi.writePattern(&textbgcolorBin[0], 2, 1); line--;
					  while(line--) {WR_L; WR_H;}
			#else
					  #ifdef ESP32_PARALLEL
						while (line--) {tft_Write_16(textbgcolor);}
					  #else
//						writeBlock(textbgcolor,line);//ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
					  #endif
			#endif
					}
				  }
				}
/*				inTransaction = false;
				spi_end();*///ToDo: modify it to make able return text-imagebuffer for next drawing with Graphics
			  }
			  // End of RLE font rendering
			#endif
			  return width * textsize;    // x +
			}
			/***************************************************************************************
			** Function name:           getTextDatum
			** Description:             Return the text datum value (as used by setTextDatum())
			***************************************************************************************/
			uint8_t Font::getTextDatum(void)
			{
			  return textdatum;
			}

			/***************************************************************************************
			** Function name:           drawChar
			** Description:             draw a single character in the Adafruit GLCD font
			***************************************************************************************/
			void Font::drawChar(T_DispCoords x, T_DispCoords y, uint16_t c, uint32_t color, uint32_t bg, uint8_t size)
			{
/*			  if ((x >= _width)            || // Clip right
				  (y >= _height)           || // Clip bottom
				  ((x + 6 * size - 1) < 0) || // Clip left
				  ((y + 8 * size - 1) < 0))   // Clip top
				return;*/ //ToDo: modify to make buffer

			  if (c < 32) return;
			#ifdef LOAD_GLCD
			//>>>>>>>>>>>>>>>>>>
			#ifdef LOAD_GFXFF
			  if(!gfxFont) { // 'Classic' built-in font
			#endif
			//>>>>>>>>>>>>>>>>>>

			  boolean fillbg = (bg != color);

			  if ((size==1) && fillbg)
			  {
				uint8_t column[6];
				uint8_t mask = 0x1;
//				spi_begin();//ToDo: modify to make buffer

//				setWindow(x, y, x+5, y+8);//ToDo: modify to make buffer

				for (int8_t i = 0; i < 5; i++ ) column[i] = pgm_read_byte(font + (c * 5) + i);
				column[5] = 0;

			#if defined (ESP8266) && !defined (ILI9488_DRIVER)
				color = (color >> 8) | (color << 8);
				bg = (bg >> 8) | (bg << 8);

				for (int8_t j = 0; j < 8; j++) {
				  for (int8_t k = 0; k < 5; k++ ) {
					if (column[k] & mask) {
					  SPI1W0 = color;
					}
					else {
					  SPI1W0 = bg;
					}
					SPI1CMD |= SPIBUSY;
					while(SPI1CMD & SPIBUSY) {}
				  }

				  mask <<= 1;

				  SPI1W0 = bg;
				  SPI1CMD |= SPIBUSY;
				  while(SPI1CMD & SPIBUSY) {}
				}
			#else // for ESP32 or ILI9488

				for (int8_t j = 0; j < 8; j++) {
				  for (int8_t k = 0; k < 5; k++ ) {
					if (column[k] & mask) {tft_Write_16(color);}
					else {tft_Write_16(bg);}
				  }
				  mask <<= 1;
				  tft_Write_16(bg);
				}

			#endif

//				spi_end();//ToDo: modify to make buffer
			  }
			  else
			  {
				//spi_begin();          // Sprite class can use this function, avoiding spi_begin()
//				inTransaction = true;//ToDo: modify to make buffer
				for (int8_t i = 0; i < 6; i++ ) {
				  uint8_t line;
				  if (i == 5)
					line = 0x0;
				  else
					line = pgm_read_byte(font + (c * 5) + i);

				  if (size == 1) // default size
				  {
					for (int8_t j = 0; j < 8; j++) {
//					  if (line & 0x1) drawPixel(x + i, y + j, color);
					  line >>= 1;
					}
				  }
				  else {  // big size
					for (int8_t j = 0; j < 8; j++) {
/*					  if (line & 0x1) fillRect(x + (i * size), y + (j * size), size, size, color);
					  else if (fillbg) fillRect(x + i * size, y + j * size, size, size, bg);*///ToDo: modify to make buffer
					  line >>= 1;
					}
				  }
				}
/*				inTransaction = false;
				spi_end();*///ToDo: modify to make buffer
			  }

			//>>>>>>>>>>>>>>>>>>>>>>>>>>>
			#ifdef LOAD_GFXFF
			  } else { // Custom font
			#endif
			//>>>>>>>>>>>>>>>>>>>>>>>>>>>
			#endif // LOAD_GLCD

			#ifdef LOAD_GFXFF
				// Filter out bad characters not present in font
				if ((c >= pgm_read_word(&gfxFont->first)) && (c <= pgm_read_word(&gfxFont->last )))
				{
				  //spi_begin();          // Sprite class can use this function, avoiding spi_begin()
//				  inTransaction = true; //ToDo: modify to make buffer
			//>>>>>>>>>>>>>>>>>>>>>>>>>>>

				  c -= pgm_read_word(&gfxFont->first);
				  GFXglyph *glyph  = &(((GFXglyph *)pgm_read_dword(&gfxFont->glyph))[c]);
				  uint8_t  *bitmap = (uint8_t *)pgm_read_dword(&gfxFont->bitmap);

				  uint32_t bo = pgm_read_word(&glyph->bitmapOffset);
				  uint8_t  w  = pgm_read_byte(&glyph->width),
						   h  = pgm_read_byte(&glyph->height);
						   //xa = pgm_read_byte(&glyph->xAdvance);
				  int8_t   xo = pgm_read_byte(&glyph->xOffset),
						   yo = pgm_read_byte(&glyph->yOffset);
				  uint8_t  xx, yy, bits=0, bit=0;
				  int16_t  xo16 = 0, yo16 = 0;

				  if(size > 1) {
					xo16 = xo;
					yo16 = yo;
				  }

			// Here we have 3 versions of the same function just for evaluation purposes
			// Comment out the next two #defines to revert to the slower Adafruit implementation

