Lagunaxx/ESP32_SPIDisplay/Extensions/Font/Font.cpp
			// If FAST_LINE is defined then the free fonts are rendered using horizontal lines
			// this makes rendering fonts 2-5 times faster. Particularly good for large fonts.
			// This is an elegant solution since it still uses generic functions present in the
			// stock library.

			// If FAST_SHIFT is defined then a slightly faster (at least for AVR processors)
			// shifting bit mask is used

			// Free fonts don't look good when the size multiplier is >1 so we could remove
			// code if this is not wanted and speed things up

			#define FAST_HLINE
			#define FAST_SHIFT
			//FIXED_SIZE is an option in User_Setup.h that only works with FAST_LINE enabled

			#ifdef FIXED_SIZE
				  x+=xo; // Save 88 bytes of FLASH
				  y+=yo;
			#endif

			#ifdef FAST_HLINE

			  #ifdef FAST_SHIFT
				  uint16_t hpc = 0; // Horizontal foreground pixel count
				  for(yy=0; yy<h; yy++) {
					for(xx=0; xx<w; xx++) {
					  if(bit == 0) {
						bits = pgm_read_byte(&bitmap[bo++]);
						bit  = 0x80;
					  }
					  if(bits & bit) hpc++;
					  else {
					   if (hpc) {
			#ifndef FIXED_SIZE
/*						  if(size == 1) drawFastHLine(x+xo+xx-hpc, y+yo+yy, hpc, color);
						  else fillRect(x+(xo16+xx-hpc)*size, y+(yo16+yy)*size, size*hpc, size, color);*///ToDo: modify to make buffer
			#else
						  drawFastHLine(x+xx-hpc, y+yy, hpc, color);
			#endif
						  hpc=0;
						}
					  }
					  bit >>= 1;
					}
				  // Draw pixels for this line as we are about to increment yy
					if (hpc) {
			#ifndef FIXED_SIZE
/*					  if(size == 1) drawFastHLine(x+xo+xx-hpc, y+yo+yy, hpc, color);
					  else fillRect(x+(xo16+xx-hpc)*size, y+(yo16+yy)*size, size*hpc, size, color);*///ToDo: modify to make buffer
			#else
					  drawFastHLine(x+xx-hpc, y+yy, hpc, color);
			#endif
					  hpc=0;
					}
				  }
			  #else
				  uint16_t hpc = 0; // Horizontal foreground pixel count
				  for(yy=0; yy<h; yy++) {
					for(xx=0; xx<w; xx++) {
					  if(!(bit++ & 7)) {
						bits = pgm_read_byte(&bitmap[bo++]);
					  }
					  if(bits & 0x80) hpc++;
					  else {
						if (hpc) {
						  if(size == 1) drawFastHLine(x+xo+xx-hpc, y+yo+yy, hpc, color);
						  else fillRect(x+(xo16+xx-hpc)*size, y+(yo16+yy)*size, size*hpc, size, color);
						  hpc=0;
						}
					  }
					  bits <<= 1;
					}
					// Draw pixels for this line as we are about to increment yy
					if (hpc) {
					  if(size == 1) drawFastHLine(x+xo+xx-hpc, y+yo+yy, hpc, color);
					  else fillRect(x+(xo16+xx-hpc)*size, y+(yo16+yy)*size, size*hpc, size, color);
					  hpc=0;
					}
				  }
			  #endif

			#else
				  for(yy=0; yy<h; yy++) {
					for(xx=0; xx<w; xx++) {
					  if(!(bit++ & 7)) {
						bits = pgm_read_byte(&bitmap[bo++]);
					  }
					  if(bits & 0x80) {
						if(size == 1) {
						  drawPixel(x+xo+xx, y+yo+yy, color);
						} else {
						  fillRect(x+(xo16+xx)*size, y+(yo16+yy)*size, size, size, color);
						}
					  }
					  bits <<= 1;
					}
				  }
			#endif
/*				  inTransaction = false;
				  spi_end();*///ToDo: modify to make buffer
				}
			#endif


			#ifdef LOAD_GLCD
			  #ifdef LOAD_GFXFF
			  } // End classic vs custom font
			  #endif
			#endif

			}


			_CoordsType Font::__width(){
				return 2000;
			}
			_CoordsType Font::__height(){
				return 2000;
			}





		}
	}
}
